**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [ ]:
import pandas as pd                                                                                          #to analyse and manipulate the data
import numpy as np                                                                                           #here used to handle NAN values
# data is a dictionary
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']                                                # list of labels
df = pd.DataFrame(data, index=labels)                                                                      # loading data into dataframe  which are having labels
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [ ]:
print(df.describe())                                        #describe function is used to calculate statistical data
print(df.info())                                            #info function is used to display the concise summary of dataframe

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

**3. Print the first 2 rows of the birds dataframe **

In [ ]:
df.head(2)                                                   #head function is used to display the top few values , here we want only top 2 values

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [ ]:
print(df[['birds','age']])                                 # column birds and age will get displayed here

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [ ]:
df[['birds','age','visits']].iloc[[2,3,7]]                                #iloc is used to select the particular location from the dataset

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [ ]:
print(df[df['visits']<4])                                             # we want only those values of visits which are less than 4

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [ ]:
null_age = df[df['age'].isnull()]                         #storing the NaN values of 'age' in the variable
null_age[['birds','visits','age']]                        #it will display the  NaN values for the particular birds and visits columns

        birds  visits  age
d  spoonbills       4  NaN
h      Cranes       2  NaN

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [ ]:
df[(df['birds']=='Cranes') & (df['age']<4)]                              #selecting only those brids which are cranes and whose age is less than 4

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [ ]:
df[(df['age']<=4) & (df['age']>=2)]                                   #select the age which are in between 2 and 4 and we have to include both (2,4).That's why equal to is used

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [ ]:
df[(df['birds'] == 'Cranes') & (df['visits'] > 0)].sum()              #Total number of visits of the Cranes birds

birds       CranesCranesCranesCranes
age                             10.5
visits                            12
priority                 yesyesnoyes
dtype: object

**11. Calculate the mean age for each different birds in dataframe.**

In [ ]:
group_df = df.groupby('birds')                                          # grouping all the birds from 'birds' column and storing them into group_df dataframe
mean_df =  group_df.mean()                                             # now taking mean of all those values stored in group.df and storing them in mean_df
print(mean_df)

            age  visits
birds
Cranes      3.5     3.0
plovers     3.5     2.5
spoonbills  6.0     3.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [ ]:
df.loc['k']=['test','20','1','yes']                           #loc is used to select specific position and here we are adding "k label" to add new values for each respective column
print(df)

        birds  age visits priority
a      Cranes  3.5      2      yes
b      Cranes    4      4      yes
c     plovers  1.5      3       no
d  spoonbills  NaN      4      yes
e  spoonbills    6      3       no
f      Cranes    3      4       no
g     plovers  5.5      2       no
h      Cranes  NaN      2      yes
i  spoonbills    8      3       no
j  spoonbills    4      2       no
k        test   20      1      yes

In [ ]:
df = df.drop('k')                                               # dropping the lable k to get the original values
print(df)

        birds  age visits priority
a      Cranes  3.5      2      yes
b      Cranes    4      4      yes
c     plovers  1.5      3       no
d  spoonbills  NaN      4      yes
e  spoonbills    6      3       no
f      Cranes    3      4       no
g     plovers  5.5      2       no
h      Cranes  NaN      2      yes
i  spoonbills    8      3       no
j  spoonbills    4      2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [ ]:
group_df = df.groupby('birds')                            #grouped all birds together in a group_df dataframe
group_df.count()                                          #counting all togethered birds stored in group_df

            age  visits  priority
birds
Cranes        3       4         4
plovers       2       2         2
spoonbills    3       4         4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [ ]:
df.sort_values('age',ascending=False)                 #sorting the age column into decending order by using sort_values function

        birds  age visits priority
i  spoonbills    8      3       no
e  spoonbills    6      3       no
g     plovers  5.5      2       no
b      Cranes    4      4      yes
j  spoonbills    4      2       no
a      Cranes  3.5      2      yes
f      Cranes    3      4       no
c     plovers  1.5      3       no
d  spoonbills  NaN      4      yes
h      Cranes  NaN      2      yes

In [ ]:
df.sort_values('visits')                         #sorting visits column into ascending order

        birds  age visits priority
a      Cranes  3.5      2      yes
g     plovers  5.5      2       no
h      Cranes  NaN      2      yes
j  spoonbills    4      2       no
c     plovers  1.5      3       no
e  spoonbills    6      3       no
i  spoonbills    8      3       no
b      Cranes    4      4      yes
d  spoonbills  NaN      4      yes
f      Cranes    3      4       no

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [ ]:
df['priority'].replace(['yes','no'],[1,0])                    # selecting 'priority' column and replacing the values of yes and no with 0 and 1

a    1
b    1
c    0
d    1
e    0
f    0
g    0
h    1
i    0
j    0
Name: priority, dtype: int64

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [ ]:
df['birds'].replace(['Cranes'],['trumpeters'])               # selecting 'birds' column and replacing/changing the values of 'Cranes' to 'trumpeters'

a    trumpeters
b    trumpeters
c       plovers
d    spoonbills
e    spoonbills
f    trumpeters
g       plovers
h    trumpeters
i    spoonbills
j    spoonbills
Name: birds, dtype: object